analyzer/background_overset/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    //- Set patchGroups for constraint patches
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"

    walls
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
   

    outerWalls
    {
       type            fixedValue;
       value           uniform (0 0 0);           
    }
   
   inlet
   {
       type            fixedValue;
       value           uniform (10 0 0);           
   } 
   outlet
   {
       type            zeroGradient;
   } 
 

    #include "include/frontBackTopBottomfreePatches"

}

// ************************************************************************* //
