analyzer/background_overset/Allrun.pre
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions


#runApplication extrudeMesh
# instead of extruding copy the 3D mesh as it is
#cp -r ../background_snappyHexMesh/constant/polyMesh/* constant/polyMesh/
runApplication extrudeMesh
runApplication createPatch -overwrite
mergeMeshes . ../aeroFoil_overset -overwrite
runApplication topoSet

# Copy standard fields
rm -rf 0 && cp -r 0.org 0

# Use cellSets to write zoneID
runApplication setFields
